rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'bg-warning hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'bg-warning hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["rating", "G"], ["release_date", "2023-02-23 00:00:00.000000"], ["created_at", "2023-02-23 16:04:28.764478"], ["updated_at", "2023-02-23 16:04:28.764478"]]
---
  def create
    @movie = Movie.create!(params[:movie])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
---
  def update
    @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 12]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy